am/OpenFOAM-10/tutorials/combustion/reactingFoam/RAS/membrane/Allrun
#!/bin/sh

cd ${0%/*} || exit 1

. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication snappyHexMesh -overwrite
runApplication createBaffles -overwrite

runApplication setFields

runApplication reactingFoam
